tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "gcc"
brew "hwloc"
brew "openssl@1.1"
brew "open-mpi"
brew "openblas"
brew "arpack"
brew "autoconf"
brew "automake"
brew "pcre"
brew "readline"
brew "sqlite"
brew "cairo"
brew "unbound", link: false
brew "gnutls"
brew "cask"
brew "cmake"
brew "tbb"
brew "ceres-solver"
brew "coreutils"
brew "ghostscript"
brew "fdk-aac"
brew "giflib"
brew "harfbuzz"
brew "webp"
brew "leptonica"
brew "sdl2"
brew "x265"
brew "xvid"
brew "ffmpeg"
brew "fftw"
brew "netpbm"
brew "findutils"
brew "gauche"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "lua"
brew "qt"
brew "gnuplot"
brew "go"
brew "graphicsmagick"
brew "gstreamer"
brew "hdf5"
brew "libheif"
brew "imagemagick"
brew "libiconv"
brew "libxml2"
brew "make"
brew "nasm"
brew "ncurses"
brew "numpy"
brew "pstoedit"
brew "sundials"
brew "texinfo"
brew "octave", link: false
brew "protobuf"
brew "opencv"
brew "peco"
brew "pkg-config"
brew "python@2", link: false
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rsync"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "the_platinum_searcher"
brew "tmux"
brew "veclibfort"
brew "wget"
brew "zsh"
brew "zsh-completions"

brew "cmigemo"
brew "fd"
brew "yazi"
brew "lazygit"

cask "adoptopenjdk"

