# -*- mode:sh -*-
# ~/.zshrc
# 作成開始: [2002/10/01]
# 改訂: [2011/07/17]
# 改訂: [2023/02/27]
#
# pluginに影響する物を更新したら以下を実施する事
# sheldon lock --update
#
#-----------------------------------------------------------------
# 基本設定
#-----------------------------------------------------------------
WORDCHARS="*?_-.[]~=&;\!#$%^(){}<>"
HISTSIZE=4096
HISTFILE=${HOME}/var/zsh/zsh_history
SAVEHIST=4096
umask 022

# 設定ファイル分割関連
ZSHD="${HOME}/.zsh.d"

#-----------------------------------------------------------------
# 判定用関数
#-----------------------------------------------------------------
# Mac OS X特有の設定を切り分るための関数
isdarwin() {
    [[ $OSTYPE == darwin* ]] && return 0
    return 1
}

# Emacs の term で動作させた場合
isemacs() {
    [[ "$EMACS" != "" ]] && return 0
    return 1
}

#-----------------------------------------------------------------
# plugin読み込み前設定(本来は他の方法がある)
#-----------------------------------------------------------------
#SHELL=/bin/zsh
isdarwin && export SHELL=/usr/local/bin/zsh

export PREFIX=/usr/local
#export EXEC_PREFIX=/usr/local/bin

# 時刻の設定
export TZ=JST-9

# 文字コード設定
export LC_ALL="ja_JP.UTF-8"

# DISPLAY
export DISPLAY="localhost"

# 一時ファイル
export TMP="${HOME}/tmp"

#-----------------------------------------------------------------
# plugin
#-----------------------------------------------------------------
# PATH
export PATH=/opt/homebrew/bin:${PATH}
export PATH=/opt/homebrew/sbin:${PATH}

# sheldon
eval "$(sheldon source)"

#-----------------------------------------------------------------
# PATH追加(本来はローカル設定とかにいれる項目)
#-----------------------------------------------------------------
export PATH=${HOME}/bin:${PATH}

#-----------------------------------------------------------------
# ローカル設定の読み込み
#-----------------------------------------------------------------
[ -f ${ZSHD}/zshrc.local ] && source ${ZSHD}/zshrc.local

echo Now zsh version $ZSH_VERSION start!

# end of ~/.zshrc
#=================================================================
